package HW.poliphormism;

public class Electro {

    //создать класс  Электро прибор с методом старт в котором написанно что электро прибор запустился
    //создать класс пылесос  наследуется от электроприбор
    //создать класс утюг наследуется от электроприбор
    //создать класс тв наследуется электроприбор
    //создать данные объекты
    //
    //создать метод который принимает любой электроприбор и запускает у него метод старт

    public void start() {
        System.out.println("Электроприбор запустился");
    }

}
